 
//------------------------------------------------------------------------------
// if
//------------------------------------------------------------------------------
let offer = "1 + 1 = 3";
if (offer == "1 + 1 = 2")
    console.log("Real World");
else
    console.log("Marketing World");

//------------------------------------------------------------------------------
// while
//------------------------------------------------------------------------------
let counter = 1;
let total = 0;
while (counter <= 10) {
    total += counter;
    counter += 1;
}
console.log(total);

//------------------------------------------------------------------------------
// do-while
//------------------------------------------------------------------------------
const FLAG = false;
do {
    console.log("HELLO");
} while(FLAG);

//------------------------------------------------------------------------------
// for
//------------------------------------------------------------------------------
for (let idx = 0; idx < 3; ++idx)
    console.log(idx + 1);

// Циклы в JavaScript поддерживают ключевые слова break и continue.

//------------------------------------------------------------------------------
// switch
//------------------------------------------------------------------------------
let mood = "good";
switch (mood) {
    case "good":
        console.log("you are lucky");
        break;

    case "bad":
        console.log("go outside");
        break;

    case "ugly":
        console.log("don't program");
        break;

    default:
        console.log("who are you?");
}

// switch поддерживает fallthrough.
